Mystfit/ESP32-BLE-CompositeHID/DualSenseGamepadDevice.cpp
// DualsenseGamepadDevice methods
DualsenseGamepadDevice::DualsenseGamepadDevice(DualsenseGamepadDeviceConfiguration* config)
    : _config(config)
    , _extra_input(nullptr)
    , _minimalInput(nullptr)
    , _callbacks(nullptr)
    , _calibration(nullptr)
    , _firmwareInfo(nullptr)
    , _pairingInfo(nullptr)
    , _btPatchInfo(nullptr)
{
}

DualsenseGamepadDevice::~DualsenseGamepadDevice()
{
    if (getOutput() && _callbacks) {
        getOutput()->setCallbacks(nullptr);
        delete _callbacks;
        _callbacks = nullptr;
    }

    if (_extra_input) {
        delete _extra_input;
        _extra_input = nullptr;
    }
    if (_firmwareInfo) {
        delete _firmwareInfo;
        _firmwareInfo = nullptr;
    }
    if (_calibration) {
        delete _calibration;
        _calibration = nullptr;
    }
    if (_pairingInfo) {
        delete _pairingInfo;
        _pairingInfo = nullptr;
    }

    if (_config) {
        delete _config;
        _config = nullptr;
    }
}

void DualsenseGamepadDevice::init(NimBLEHIDDevice* hid)
{
    /// Create input characteristic to send events to the computer
    NimBLECharacteristic* input = hid->getInputReport(DUALSENSE_EDGE_INPUT_REPORT_ID);

    // Minimal Generic Desktop input report 0x01. Real DualSense exposes this
    // alongside 0x31 so Windows HIDClass activates the full input pipe.
    _minimalInput = hid->getInputReport(DUALSENSE_MINIMAL_INPUT_REPORT_ID);

    // Create output characteristic to handle events coming from the computer
    NimBLECharacteristic* output = hid->getOutputReport(DUALSENSE_EDGE_OUTPUT_REPORT_ID);
    _callbacks = new DualsenseGamepadCallbacks(this);

    // Second output characteristic for the haptic-audio sub-protocol report
    // (0x32). Real DualSense-targeted tools (SAxense, kijimad/soundsense) write
    // 142-byte 0x32 reports carrying 0x11 control + 0x12 audio sub-packets;
    // the parser in DualsenseGamepadOutputReportData::load() recognises both
    // formats so the same callback handles either characteristic.
    NimBLECharacteristic* hapticOutput = hid->getOutputReport(DUALSENSE_EDGE_HAPTIC_OUTPUT_REPORT_ID);

    // Third output characteristic for the larger haptic-audio report (0x36).
    // Same 0x11 + 0x12 sub-packet protocol as 0x32 but in a 398-byte buffer,
    // with room for an optional 0x15 sub-packet for headset audio. Recent
    // Unreal-Dualsense plugin builds emit this variant. Without a dedicated
    // characteristic, Windows BLE HoGP has nowhere to deliver 0x36 writes.
    NimBLECharacteristic* hapticOutputLarge = hid->getOutputReport(DUALSENSE_EDGE_HAPTIC_OUTPUT_REPORT_ID_LARGE);

    // Set callbacks on all characteristics so we can track reads/writes
    input->setCallbacks(_callbacks);
    _minimalInput->setCallbacks(_callbacks);
    output->setCallbacks(_callbacks);
    hapticOutput->setCallbacks(_callbacks);
    hapticOutputLarge->setCallbacks(_callbacks);

    // pending callbacks for pairing and stuff
    _calibration = hid->getFeatureReport(DUALSENSE_CALIBRATION_REPORT_ID);
    _calibration->setCallbacks(_callbacks);
    _firmwareInfo = hid->getFeatureReport(DUALSENSE_FIRMWARE_INFO_REPORT_ID);
    _firmwareInfo->setCallbacks(_callbacks);
    _pairingInfo = hid->getFeatureReport(DUALSENSE_PAIRING_INFO_REPORT_ID);
    _pairingInfo->setCallbacks(_callbacks);
    _btPatchInfo = hid->getFeatureReport(DUALSENSE_BT_PATCH_REPORT_ID);
    _btPatchInfo->setCallbacks(_callbacks);
    // memcpy(_pairingReport.mac_address,hid->esp_bt_dev_get_address();
    setCharacteristics(input, output);

    // Log characteristic handles for debugging
    ESP_LOGI(LOG_TAG, "Characteristic handles: input=%d, output=%d, hapticOutput=%d, hapticOutputLarge=%d, calibration=%d, firmwareInfo=%d, pairingInfo=%d",
        input->getHandle(), output->getHandle(), hapticOutput->getHandle(), hapticOutputLarge->getHandle(),
        _calibration->getHandle(), _firmwareInfo->getHandle(), _pairingInfo->getHandle());
    m_pCrcTable = new uint32_t[256];
    generate_crc_table(m_pCrcTable);

    // Pre-populate feature reports so they're ready when host reads them
    // This is critical for Steam to recognize controller capabilities (vibration, etc.)
    ESP_LOGI(LOG_TAG, "Pre-populating feature reports...");

    uint8_t calibBuf[DUALSENSE_CALIBRATION_REPORT_SIZE] = {};
    buildFeatureReportWithCrc(DUALSENSE_CALIBRATION_REPORT_ID,
        DualsenseEdge_StockCalibration, DUALSENSE_CALIBRATION_REPORT_SIZE - 5,
        calibBuf, DUALSENSE_CALIBRATION_REPORT_SIZE);
    _calibration->setValue(calibBuf, DUALSENSE_CALIBRATION_REPORT_SIZE);

    uint8_t firmBuf[DUALSENSE_FIRMWARE_INFO_REPORT_SIZE] = {};
    buildFeatureReportWithCrc(DUALSENSE_FIRMWARE_INFO_REPORT_ID,
        DualsenseEdge_FirmwareInfo, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE - 5,
        firmBuf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);
    _firmwareInfo->setValue(firmBuf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);

    // Pairing info report (0x09) - includes MAC address
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_BT);
    memcpy(_pairingReport.mac_address, mac, 6);
    memcpy(_pairingReport.common, (uint8_t*)&DualsenseEdge_PairInfo_common, 9);
    uint8_t pairHdr[] = { PS_FEATURE_CRC32_SEED, DUALSENSE_PAIRING_INFO_REPORT_ID };
    uint32_t pairCrc = crc32_le(0xFFFFFFFF, pairHdr, sizeof(pairHdr));
    pairCrc = ~crc32_le(pairCrc, (uint8_t*)&_pairingReport, offsetof(DualsenseGamepadPairingReportdata, crc32));
    _pairingReport.crc32 = pairCrc;
    _pairingInfo->setValue((uint8_t*)&_pairingReport, DUALSENSE_PAIRING_INFO_REPORT_SIZE);

    // BT patch version (0x22) - zero-filled payload + CRC. DSX reads this during
    // handshake; if the characteristic doesn't exist or size mismatches, Windows
    // rejects the GATT read with Win32 error 87 and tears down the HID session.
    uint8_t btPatchBuf[DUALSENSE_BT_PATCH_REPORT_SIZE];
    uint8_t btPatchPayload[DUALSENSE_BT_PATCH_REPORT_SIZE - 4] = { 0 };
    buildFeatureReportWithCrc(DUALSENSE_BT_PATCH_REPORT_ID,
        btPatchPayload, sizeof(btPatchPayload),
        btPatchBuf, DUALSENSE_BT_PATCH_REPORT_SIZE);
    _btPatchInfo->setValue(btPatchBuf, DUALSENSE_BT_PATCH_REPORT_SIZE);

    // Minimal 0x01 input report default: sticks centered (0x80), hat = 8 (centered/null),
    // buttons = 0, triggers = 0. Layout: X,Y,Z,Rz, (hat+pad), btnLo, btnHi, Rx, Ry.
    uint8_t minimalDefault[DUALSENSE_MINIMAL_INPUT_REPORT_SIZE] = {
        0x80, 0x80, 0x80, 0x80,  // X, Y, Z, Rz (sticks centered)
        0x08,                     // hat = 8 (null) in low nibble, high nibble pad
        0x00, 0x00,              // 14 buttons + 6 bits padding
        0x00, 0x00               // Rx, Ry (triggers)
    };
    _minimalInput->setValue(minimalDefault, sizeof(minimalDefault));

    ESP_LOGI(LOG_TAG, "Feature reports pre-populated");
}

