Mystfit/ESP32-BLE-CompositeHID/DualSenseGamepadDevice.cpp
void DualsenseGamepadDevice::buildFeatureReportWithCrc(
    uint8_t reportId, const uint8_t* payload, size_t payloadSize,
    uint8_t* outBuffer, size_t outSize)
{
    if (outSize < payloadSize + 4) return;
    memcpy(outBuffer, payload, payloadSize);
    uint8_t hdr[] = { PS_FEATURE_CRC32_SEED, reportId };
    uint32_t crc = crc32_le(0xFFFFFFFF, hdr, sizeof(hdr));
    crc = ~crc32_le(crc, outBuffer, payloadSize);
    outBuffer[payloadSize + 0] = (uint8_t)(crc & 0xFF);
    outBuffer[payloadSize + 1] = (uint8_t)((crc >> 8) & 0xFF);
    outBuffer[payloadSize + 2] = (uint8_t)((crc >> 16) & 0xFF);
    outBuffer[payloadSize + 3] = (uint8_t)((crc >> 24) & 0xFF);
}

const BaseCompositeDeviceConfiguration* DualsenseGamepadDevice::getDeviceConfig() const
{
    // Return the device configuration
    return _config;
}

void DualsenseGamepadDevice::resetInputs()
{
    std::lock_guard<std::mutex> lock(_mutex);
    memset(&_inputReport, 0, sizeof(DualsenseGamepadInputReportData));

    _inputReport.bt = 0x01;  // BLE header: HasHID=1 (contains state data)
    _inputReport.x  = DUALSENSE_AXIS_CENTER_OFFSET;  // left stick X
    _inputReport.y  = DUALSENSE_AXIS_CENTER_OFFSET;  // left stick Y
    _inputReport.rx = DUALSENSE_AXIS_CENTER_OFFSET;  // right stick X
    _inputReport.ry = DUALSENSE_AXIS_CENTER_OFFSET;  // right stick Y
    _inputReport.z  = 0;                              // L2 trigger (rest)
    _inputReport.rz = 0;                              // R2 trigger (rest)
    _inputReport.seq = 0x20;
    _inputReport.buttons[0] = 0;
    _inputReport.buttons[1] = 0;
    _inputReport.buttons[2] = 0;
    hat_set(_inputReport.buttons, DUALSENSE_BUTTON_DPAD_NONE);
    _inputReport.extra_buttons = 0;
    _inputReport.touchpoint_l_contact = 0x80;
    _inputReport.touchpoint_r_contact = 0x80;
    _inputReport.timestamp = 0x7621DD40;
    _inputReport.status = 0x0A;  // 100% battery, discharging

    // Controller at rest: ~1g on the axis facing down.
    _inputReport.accel_x = 0;
    _inputReport.accel_y = -DUALSENSE_ACC_RES_PER_G;
    _inputReport.accel_z = 0;

    _inputReport.gyro_x = 0;
    _inputReport.gyro_y = 0;
    _inputReport.gyro_z = 0;
}

void DualsenseGamepadDevice::press(uint32_t button)
{
    if (!isPressed(button)) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            buttons_set(_inputReport.buttons, button);
            ESP_LOGD(LOG_TAG, "DualsenseGamepadDevice::press, button: %d", button);
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}
void DualsenseGamepadDevice::setLeftTouchpad(uint16_t x, uint16_t y)
{

    if (_inputReport.touchpoint_l_contact != 0x00) {
        std::lock_guard<std::mutex> lock(_mutex);
        _inputReport.touchpoint_l_contact = 0x00;
    }
    _inputReport.touchpoint_l_x = x & 0xFFF;
    _inputReport.touchpoint_l_y = y & 0xFFF;
    if (_config->getAutoReport()) {
        sendGamepadReport();
    }
}
void DualsenseGamepadDevice::setRightTouchpad(uint16_t x, uint16_t y)
{

    if (_inputReport.touchpoint_r_contact != 0x00) {
        std::lock_guard<std::mutex> lock(_mutex);
        _inputReport.touchpoint_r_contact = 0x00;
    }
    _inputReport.touchpoint_r_x = x & 0xFFF;
    _inputReport.touchpoint_r_y = y & 0xFFF;
    if (_config->getAutoReport()) {
        sendGamepadReport();
    }
}
void DualsenseGamepadDevice::releaseLeftTouchpad()
{
    _inputReport.touchpoint_l_contact = 0x80;
    if (_config->getAutoReport()) {
        sendGamepadReport();
    }
}
void DualsenseGamepadDevice::releaseRightTouchpad()
{
    _inputReport.touchpoint_r_contact = 0x80;
    if (_config->getAutoReport()) {
        sendGamepadReport();
    }
}

void DualsenseGamepadDevice::release(uint32_t button)
{
    if (isPressed(button)) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            buttons_clear(_inputReport.buttons, button);
            ESP_LOGD(LOG_TAG, "DualsenseGamepadDevice::release, button: %d", button);
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

bool DualsenseGamepadDevice::isPressed(uint32_t button)
{
    std::lock_guard<std::mutex> lock(_mutex);
    return buttons_test(_inputReport.buttons, button);
}

void DualsenseGamepadDevice::setLeftThumb(int8_t x, int8_t y)
{
    x = constrain(x, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX);
    y = constrain(y, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX);

    if (_inputReport.x != x || _inputReport.y != y) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.x = (uint8_t)(x + DUALSENSE_AXIS_CENTER_OFFSET);
            _inputReport.y = (uint8_t)(y + DUALSENSE_AXIS_CENTER_OFFSET);
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setRightThumb(int8_t x, int8_t y)
{
    x = constrain(x, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX);
    y = constrain(y, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX);

    uint8_t rx = (uint8_t)(x + DUALSENSE_AXIS_CENTER_OFFSET);
    uint8_t ry = (uint8_t)(y + DUALSENSE_AXIS_CENTER_OFFSET);

    if (_inputReport.rx != rx || _inputReport.ry != ry) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.rx = rx;
            _inputReport.ry = ry;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setLeftTrigger(uint8_t value)
{
    value = constrain(value, DUALSENSE_TRIGGER_MIN, DUALSENSE_TRIGGER_MAX);

    if (_inputReport.z != value) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.z = value;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setRightTrigger(uint8_t value)
{
    value = constrain(value, DUALSENSE_TRIGGER_MIN, DUALSENSE_TRIGGER_MAX);

    if (_inputReport.rz != value) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.rz = value;
        }

